// // 1. Вивести в консоль всі числа від 1 до 10 за допомогою циклу while.
// let num = 1;
// while (num <= 10) {
//   console.log(num);
//   num += 1;
// }

// // 2. Вивести в консоль всі парні числа від 2 до 20 за допомогою циклу for. Якщо число непарне, пропустити його за допомогою continue.
// let i = 2;

// for (let i = 2; i <= 20; i += 1) {
//   if (i % 2 !== 0) {
//     continue;
//   }
//   console.log("Це число парне: ", i);
// }

// // 3. Вивести в консоль таблицю множення числа 7 за допомогою циклу for.
// for (let I = 1; I <= 10; I += 1) {
//   console.log(`7 * ${I} = ${7 * I}`);
// }

// // 6. Створити скрипт, який виводить в консоль всі числа , які менші за n. Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.
// let n = 15;
// let numbers = [10, 5, 20, 12, 8, 18, 3];

// for (let i = 0; i < numbers.length; i += 1) {
//   if (numbers[i] >= n) {
//     continue;
//   }
//   console.log(numbers[i]);
// }

// // 7. За допомогою циклу while вивести в консоль всі числа від 1 до 20, крім чисел, кратних 3. Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue.
// let k = 1;

// while (k <= 20) {
//   if (k % 3 === 0) {
//     k += 1;
//     continue;
//   }
//   console.log(k);
//   k += 1;
// }
